title: 'Windows - Event Triggered Execution: Change Default File Association'
id: 19469c03-2a2e-4cce-953c-374a8d16c40d
status: stable
description: 'This rule detects the behavior generated by modifying the registry key of a file extension, to perform Persistence.'
references:
    - 'https://attack.mitre.org/techniques/T1546/001/'
author: Bryenne Soares
date: 22/03/2024
tags:
    - attack.persistence.TA0003
    - attack.T1546.001 # Event Triggered Execution: Change Default File Association
logsource:
    category: 'process_creation'
    product: 'windows', 'sysmon'
detection:
    RegistryModification:
      EventID:
        - 4657
        - 13
      TargetRegistryKey|contains|all:
        - 'shell'
        - 'open'
        - 'command'
    condition: RegistryModification
fields:
    - ProcessName;
    - TargetObject.
falsepositives:
    - No
level: high
