title: 'Linux - Persistence Using Cron Scheduled Tasks'
id: edc14135-1567-4366-85a9-37afb55a7e33
status: stable
description: 'This rule detects behavior generated by creating Cron scheduled tasks'
references:
    - 'https://attack.mitre.org/techniques/T1053/003/'
author: Bryenne Soares
date: 28/06/2024
tags:
    - attack.persistence.TA0003
    - attack.T1053.003 # Scheduled Task/Job: Cron
logsource:
    category: 
    product: Linux
    definition: auditd
detection: 
    Path_Name: 
      path_name|contains:
      - '/etc/cron.d/'
      - '/etc/cron.daily/'
      - '/etc/cron.hourly/'
      - '/etc/cron.monthly/'
      - '/etc/cron.weekly/'
      - '/etc/crontab'
    Work_Dir:
      work_dir|contains:
      - '/var/spool/cron'
    condition: Path_Name OR Work_Dir
fields:
    - 'CWD'
    - 'Path_Parent'
    - 'Path_Create'
falsepositives:
    - "É necessário validar se foi realizado uma ação administrativa de conhecimento da equipe de infraestrutura"
level: high
