title: Linux - Persistence Using SSH Authorized Keys
id: d4bb6e92-00b8-48be-a11e-bf6591796548
status: stable
description: 'This rule detects the behavior generated by modifying the SSH authorized key file on Linux, to perform Persistence.'
references:
    - 'https://attack.mitre.org/techniques/T1098/004/'
author: Bryenne Soares 
date: 17/05/2024
tags:
    - attack.persistence.TA0003
    - attack.T1098.004 # Account Manipulation: SSH Authorized Keys
logsource:
    category: 'process_creation'
    product: 'sysmon'
detection:
    Process_Creation:
      EventID:
        - 1
      Process.command_line|contains|all:
        - 'authorized_keys'
    condition: Process_Creation
fields:
    - 'User'
    - 'ParentUser'
falsepositives:
    - "É necessário validar se foi realizado uma ação administrativa de conhecimento da equipe de infraestrutura"
level: high
