title: 'Windows - Akira: Home Access / User Creation / Scheduled Tasks'
id: cd48e4cf-4642-418f-83e3-7f0dbb7ac516
status: stable
description: 'Detects suspicious activity related to user logon, account creation, and scheduled task creation.'
references: 
    - 'https://attack.mitre.org/techniques/T1078/'
    - 'https://attack.mitre.org/techniques/T1136/002/'
author: Bryenne Soares
date: 14/11/2024
tags:
    - attack.initial access.TA0001
    - attack.T1078 # Valid Accounts
    - attack.persistence.TA0003
    - attack.T1543.002 # Create Account: Domain Account
    - attack.t1053
    - attack.execution
    - attack.privilege_escalation
logsource:
    category: security
    product: windows
    definition: sysmon
detection:
    selection_logon:
      EventID:
      - 4624  # Successful logon
      - 4625  # Failed logon
    selection_user_creation:
      EventID:
      - 4720  # User account creation
      - 4722  # User account enabled
      - 4732  # User added to security-enabled global group
    selection_task_creation:
      EventID:
      - 4698  # Criação de nova tarefa agendada
    selection_process_creation|contains:
      EventID:
      - 4688 # Um processo foi criado.
      process.name:
      - 'schtasks.exe'
    condition: selection_logon or selection_user_creation or (selection_task_creation and selection_process_creation)
fields:
    - EventID
    - user.name
    - process.name
falsepositives:
    - "Ações administrativas legítimas ao criar contas e tarefas agendadas para manutenção ou backup de sistemas."
level: high
